---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleView.GetSectionData(Autodesk.Revit.DB.SectionType)
source: html/67b163c9-8a6a-08bd-3abf-ae2d54e3c7e0.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleView.GetSectionData Method

Gets section data that will be written to

## Syntax (C#)
```csharp
public TableSectionData GetSectionData(
	SectionType sectionType
)
```

## Parameters
- **sectionType** (`Autodesk.Revit.DB.SectionType`) - The section type

## Returns
The TableSectionData

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration